pages/guilda-ia/10-desenvolvimento.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Desenvolvimento Livre - Montando o Agente</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 11 - Guilda de IA: Tempo para desenvolver, ajustar e consolidar o agente" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/pages/guilda-ia/10-desenvolvimento.html">
<meta property="og:type" content="website">
<meta property="og:title" content="Desenvolvimento Livre - Montando o Agente">
<meta property="og:description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 11 - Guilda de IA: Tempo para desenvolver, ajustar e consolidar o agente">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/pages/guilda-ia/10-desenvolvimento.html">
<meta name="twitter:title" content="Desenvolvimento Livre - Montando o Agente">
<meta name="twitter:description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 11 - Guilda de IA: Tempo para desenvolver, ajustar e consolidar o agente">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Desenvolvimento Livre - Montando o Agente</h1>
</div>
<div id="content" class="content">
<div id="outline-container-orgd31e0f6" class="outline-2">
<h2 id="orgd31e0f6">Semana 11 - Desenvolvimento Livre</h2>
</div>

<div id="outline-container-org4624c03" class="outline-2">
<h2 id="org4624c03">O momento</h2>
<div class="outline-text-2" id="text-org4624c03">
<p>
Você passou por:
</p>
<ul class="org-ul">
<li>Semana 1: Nomenclaturas (O que é IA hoje?)</li>
<li>Semana 2: Prompting básico</li>
<li>Semana 3-4: Python mínimo e intermediário</li>
<li>Semana 5: Estrutura de Agente</li>
<li>Semana 6: Primeira Ferramenta</li>
<li>Semana 7: Múltiplas Ferramentas</li>
<li>Semana 8: Embeddings</li>
<li>Semana 9: RAG</li>
</ul>

<p>
Agora é hora de <b>consolidar tudo</b>.
</p>
</div>
</div>
<div id="outline-container-org1535925" class="outline-2">
<h2 id="org1535925">Objetivo da semana</h2>
<div class="outline-text-2" id="text-org1535925">
<p>
<b><b>Ter um agente funcionando com:</b></b>
</p>
<ul class="org-ul">
<li>Personalidade definida</li>
<li>Uma ferramenta funcional</li>
<li>Memória de conversa</li>
<li>(Opcional) RAG implementado</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd69518" class="outline-2">
<h2 id="orgbd69518">Checklist básico</h2>
<div class="outline-text-2" id="text-orgbd69518">
<p>
<b><b>Personalidade:</b></b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> O agente tem um nome?</li>
<li class="off"><code>[&#xa0;]</code> O tom de voz está definido?</li>
<li class="off"><code>[&#xa0;]</code> As instruções de sistema estão claras?</li>
</ul>

<p>
<b><b>Ferramenta:</b></b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> A ferramenta funciona sozinha?</li>
<li class="off"><code>[&#xa0;]</code> O agente sabe quando usar?</li>
<li class="off"><code>[&#xa0;]</code> A resposta chega correta?</li>
</ul>

<p>
<b><b>Memória:</b></b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> O agente lembra da conversa?</li>
<li class="off"><code>[&#xa0;]</code> O histórico não está inflando demais?</li>
</ul>

<p>
<b><b>RAG (opcional):</b></b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Embeddings funcionando?</li>
<li class="off"><code>[&#xa0;]</code> Busca retorna documentos relevantes?</li>
<li class="off"><code>[&#xa0;]</code> Resposta usa o contexto?</li>
</ul>
</div>
</div>
<div id="outline-container-org7afb919" class="outline-2">
<h2 id="org7afb919">Demo ask-ai</h2>
<div class="outline-text-2" id="text-org7afb919">
<p>
Nessa aula vamos demonstrar um agente completo com:
</p>
<ul class="org-ul">
<li>Múltiplas ferramentas</li>
<li>RAG funcionando</li>
<li>Personalidade coerente</li>
</ul>

<p>
<b><b>Isso é expositivo</b></b> — você não precisa implementar tudo. É para ver as possibilidades e se inspirar.
</p>
</div>
</div>
<div id="outline-container-org4395721" class="outline-2">
<h2 id="org4395721">Formato da aula</h2>
<div class="outline-text-2" id="text-org4395721">
<p>
<b><b>Primeira metade:</b></b> Demo e mentoria
</p>
<ul class="org-ul">
<li>Demo de agente completo (ask-ai)</li>
<li>Dúvidas e ajustes individuais</li>
<li>Tempo para desenvolver</li>
</ul>

<p>
<b><b>Segunda metade:</b></b> Desenvolvimento livre
</p>
<ul class="org-ul">
<li>Cada um no seu ritmo</li>
<li>Mentoria disponível</li>
<li>Testando e ajustando</li>
</ul>
</div>
</div>
<div id="outline-container-orgcbcbeac" class="outline-2">
<h2 id="orgcbcbeac">Dicas para desenvolver</h2>
<div class="outline-text-2" id="text-orgcbcbeac">
<p>
<b><b>Comece simples:</b></b>
</p>
<ol class="org-ol">
<li>Agente conversa básico funcionando</li>
<li>Adicione uma ferramenta</li>
<li>Defina personalidade</li>
<li>Adicione memória</li>
<li>(Só depois) RAG</li>
</ol>

<p>
<b><b>Não tente fazer tudo de uma vez.</b></b>
</p>

<p>
<b><b>Teste sempre:</b></b>
</p>
<ul class="org-ul">
<li>"Oi, quem é você?"</li>
<li>"Quanto é 2 + 2?" (se tiver calculadora)</li>
<li>"O que você sabe sobre X?" (se tiver RAG)</li>
</ul>
</div>
</div>
<div id="outline-container-org376a77b" class="outline-2">
<h2 id="org376a77b">Para lembrar</h2>
<div class="outline-text-2" id="text-org376a77b">
<blockquote>
<p>
"Um agente simples funcionando vale mais que um agente complexo quebrado."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org8a029d5" class="outline-2">
<h2 id="org8a029d5">Próxima semana</h2>
<div class="outline-text-2" id="text-org8a029d5">
<p>
<b><b>Apresentações:</b></b> mostre seu agente para o grupo!</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<h3><a href="/pages/guilda-ia/">&#8592; Voltar para Guilda de IA</a></h3>
</div>
</body>
</html>
